Prepost_CCP/0/p
/*--------------------------------*- C++ -*----------------------------------*\

  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    nozzle
    {
        type             zeroGradient;
    }
   
    topOutflow
    {
        type             zeroGradient;
    }

    bottomOutflow
    {
        type             fixedValue;
        value    	 uniform 0;
    }
}

// ************************************************************************* //
